{
    "scraped_data": {
        "https://ted.adventist.org/mission/mission-board/": "Home»Mission BoardThe Trans-European Division (TED) Mission board meets throughout the year for the purpose of considering major mission initiatives and approving project funding requests. For information and instructions on applying for funds, see below.TED Mission Board Funding 2024 – 2025Deadlines for ApplicationsFor any questions related to funding applications, contactZina Tsvetanova.OVERVIEW OF THE FIVE FUNDS(read first before applying!)1) Global Mission Church Planting FormsDownload applicationDownload instructionsUpload application(if unable to enter onmps.adventist.org)2) Urban Centres of InfluenceOverview and applicationUpload application(after local field and union approval)3) TED Mission Board ProjectsDownload directions and applicationUpload application(after local field and union approval)4) TED Creative & Innovative Outreach FundDownload directions and applicationUpload application(after local field and union approval)5) GC Mission Impact FundOverview and applicationUpload application(after local field and union approval)",
        "https://ted.adventist.org/mission/mission-board/centres-of-influence/": "Home»Mission Board»Centres of InfluenceOverviewApplication:Visit theurbancenters.org/applicationfor more information regarding guidelines, application, business plan checklist, etc.Approval process:Regular communication between all levels regarding strategy and long-term viability is essential before local missions/conferences, unions, and Trans-European Division (TED) Mission Board make funding commitments, and recommend the application to General Conference (GC) Mission Board.Forconsultationcontact Anthony WagenerSmith at[email protected]. To upload completed application after local field and union approval, visitted.adventist.org/mission/mission-board.Receiving funds:If approved by the GC Mission Board, GC funds are credited to the TED which – along with each level – adds its yearly contributions and credits the totals through the system to the local project.Reports:Annual, ministry and financial reports must be submitted by the local field and approved by all levels before the additional year’s funding is sent.",
        "https://ted.adventist.org/mission/mission-board/gc-mission-impact-fund/": "Home»Mission Board»GC Mission Impact FundOverviewDownload theapplicationand theproject budget.Local Field and Union must approve before submitting application.Upload completed application:Click to UploadPurpose of FundI will Go!:The General Conference strategy “I Will Go!” envisions every level of the church—including local churches—to be actively engaged in expressing its KPI’s, or “key performance indicators”. These can be viewed atiwillgo2020.org.Alignment of Financial Resources with KPI’s:The General Conference created this fund to allocate financial resources specifically to local churches or schools who are doing frontline mission that fulfil one or more GC KPI’s.Project Examples:For more info regarding the fund’s purpose and past examples, visitwillplan.org/services/missionimpactfund.Financial Amounts:As a general estimate, applications should range from $30,000 – $100,000 and can be spread out over two years.Process after Application SubmissionTED Mission Board will recommend up to fifteen projects to the GC at a Mission Board following the deadline of21 February 2025.GC votes Mission Impact Project after TED’s recommendations.Once the project is approved, GC credits funds to TED, which then credits funds to the union, local conference or mission before reaching the local church. For multi-year projects, it is within TED’s discretion to release partial funds year by year.A mission and financial report must be completed at the end of each project.",
        "https://ted.adventist.org/mission/about/": "Home»AboutThe Adventist commitment to mission includes worldwide humanitarian work, international volunteer programmes, Global Mission pioneer programme, a large network of hospitals and clinics, digital media and internet radio blanketing the globe, thousands of schools, and hundreds of overseas missionaries.We work together with unions and attached missions to equip, resource, and facilitate evangelism, church planting, and diverse forms of mission across the 22 countries of the Trans-European Division.TeamAnthony WagenerSmithAdventist Mission Director[email protected]+44 1727 732 500Previous to serving at the Trans-European Division, Anthony was associate director at the North American Division Evangelism Institute (NADEI) equipping pastors and church planters across North America in the areas of evangelism and church planting, and teaching practical theology at the SDA Theological Seminary on the campus of Andrews University. He spent many years pastoring and planting churches in the Florida Conference, and is passionate about working with leaders to develop mission in all its forms.Deana StojkovicPersonal Assistant, Adventist Mission department[email protected]+44 1727 732 500Deana Stojković joined the Trans-European Division in March 2010 as part of the Communication and Media team as an Administrative Assistant and for many years supported tedMEDIA Productions serving in various roles.In December 2022, Deana transitioned to the Adventist Mission department, and she enjoys learning more about evangelism and mission.On a personal note, Deana is happily married to Dejan and together they have three children. She finds joys in engaging in craft activities and culinary experimenting with her children, visiting new places, and occasionally indulging in reading.She finds comfort and encouragement in seeing God’s loving and guiding hand in both moments of joy and adversity, and she would love nothing more than to be able to show that to others too.",
        "https://ted.adventist.org/departments/adventist-mission/": "Home»Departments»Adventist MissionTheAdventist mission departmentcommitment to mission includes worldwide humanitarian work, international volunteer programs, Global Mission pioneer programme, a large network of hospitals and clinics, digital media and internet radio blanketing the globe, thousands of schools, and hundreds of overseas missionaries.Working together with unions and attached missions to equip, resource, and facilitate evangelism, church planting, and diverse forms ofmission.Click here for the TED Mission websiteor click the image below"
    },
    "pdf_data": {
        "3-MB-Project-Application.pdf": "TRANS-E UROPEAN DIVISION \n1 APPLICATION FOR TED  MISSION BOARD PROJECT  \nHow to use this form  \n•Download and s ubmit application online at ted.adventist.org/departments/adventist-mission\n•The application contains four steps – Basic Information, Project Description, Budget Request\nand Project Funding .\nOver\nview \n•Preparation of application:  Local field and union must approve the application before union \nsubmits to TED. After submission, there is communication with the Adventist Mission  \ndepartment before possible vote by the Mission Board.\n•Financial participation : mandatory at all levels except GC.\n•Follow-up communication : applicants will be informed of application outcome.\n•Receiving funds: After project vote, TED’s contribution is credited to the union who—along  \nwith each level —adds and credits its contribution towards the project.\n•Report: A basic report must be submitted online by the project director within twelve months \nof receiving the funds ( ted.adventist.org/departments/adventist-mission ).\nStep 1: Basic information  \nYear of the outreach: Country: \nProject title: City/Town: 2 People Group: \nEstimate Population in People Group:  TRANS-E UROPEAN DIVISION \nProject Director name: \nProject Director email address: \nOrganisation responsible: Estimate of SDA Presence: \nStep 2 : Project Description \nWhen you make the actual application online, the applicant will attach their own project description \nincluding details on preparation, conducting the outreach initiati ve, and a follow -up process.  TRANS-E UROPEAN DIVISION \n3 Step 3 : Budget request  \nBudget request in local currency  \nDescription  Amount  \nItem 1:  \nItem 2:  \nItem 3:  \nItem 4:  \nItem 5:  \nItem 6:  \nItem 7:  \nItem 8: \nItem 9:  \nItem 10: \nItem 11:  \nItem 12 : \nTotal:  Name of local currency:  TRANS-E UROPEAN DIVISION \n4 Step 4: Project Funding\nBudget contribution in local currency  \nLocal church: \nConference/Mission:  \nUnion:  \nDivision funding requested:  \nTotal:  \nThis application must be submitted online (ted.adventist.org/departments/adventist-mission ). Name of local currency:",
        "4-CIOF-Application.pdf": "TRANS-EUROPEAN DIVISION \n1 APPLICATION FOR  CREATIVE AND INNOVATIVE OUTREACH FUND \n(CIOF)\nHow to use this form  \n•Download and submit application online at ted.adventist.org/departments/adventist-mission\n•The application contains four steps – Basic Information, Project Description, Budget Request\nand Project Funding .\nOverview  \n•Purpose: The CIOF fund exists to enable local churches to fund missional projects that have \nnot been tried before (i.e. sports, arts, media, business, education, etc.). The total fund of\n£32,000 is spread across the top applications each year.\n•When to apply:  All applications must be submitted online by 21 February , 2025, for  \nconsideration by the March TED Mission Board.\n•Preparation of application:  After application submission, there is communication with the \nAdventist Mission department before possible vote by the Mission Board.\n•Follow-up communication : applicants will be informed of application outcome.\n•Receiving funds: After project vote, TED’s contribution is credited to the union who—along  \nwith each level —adds and credits its contribution towards the project.\n•Report: A basic report must be submitted online by the project director within twelve months \nof receiving the funds (ted.adventist.org/departments/adventist-mission ).\nStep 1: Basic information  \nYear of the outreach: Country: \nProject title: City/Town: 2 TRANS-EUROPEAN DIVISION\nProject Director name: People Group: \nProject Director email address: Estimate Population in People Group:  \nOrganisation responsible: Estimate of SDA Presence: \nStep 2 : Project Description \nWhen you make the actual application online, the applicant will attach their own project descri ption \nincluding details on preparation, conducting the outreach initiative, and a follow -up process.  TRANS-EUROPEAN DIVISION \n3 Step 3 : Budget request  \nBudget request in local currency\nDescription  Amount  \nItem 1:  \nItem 2:  \nItem 3:  \nItem 4:  \nItem 5:  \nItem 6: \nItem 7:  \nItem 8:  \nItem 9 : \nItem 10: \nItem 11:  \nItem 12:  \nTotal:  Name of local currency:TRANS-EUROPEAN DIVISION \n4 Step 4: Project Funding\nBudget contribution in local currency  \nLocal church: \nConference/Mission:  \nUnion:  \nDivision funding requested:  \nTotal:  \nThis application must be submitted online (ted.adventist.org/departments/adventist-mission ). Name of local currency:",
        "4-Global-Mission-Church-Planting-Forms.pdf": "TRANS-EUROPEAN DIVISION\n1 GLOBAL MISSION CHURCH PLANTING FORMS  \nHow to use this form \nThis form contai ns two part s – the Initi al Application [page s 2-6 ] and the Annua l Plan and Repor t [pag es 7-\n10]. The Annual plan and report must be completed after the funds are spent and before the following year’s \nfunds can be sent. To download this form and receive more info about Global Mission, please visit \nted.adventist.org/departments/adventist-mission\nOverview \nPlease have the church planter(s) complete the relevant portion of the form. After completion, the planter(s) \nreturns the form to the Adventist Mission coordinator/director in their field who  enters the date in the online  \nglobal mission database (mps.adventist.org) . As an alternative service, this form can be uploaded at \nted.adventist.org/departments/adventist-mission  and the data entered by TED Adventist Mission on behalf\nof the local field.\nNotes \n•If the Annual plan and report is not completed by the local field and approved by all levels within 12  \nmonths, the General Conference will recall the funds!\n•The duration  of each project is three years among a Christian context and five years among a non-\nChristian context [with seven years extension in special circumstances]. Initial applications can be \nmade at any time during the calendar year, but the official start date for the fiscal year  of each \nplant is when the General Conference commits funds.\n•The percentage of annual funding levels from the General Conference and TED stays the same \nthroughout the duration of the project.\n•The Annual Funding Process is as follows: The GC votes funds and credits them to the TED. Then \nthe TED votes their contribution in addition to the GC contribution and credits the combined amount to \nthe Union. Then the Union votes their contribution which is added to the GC & TED and credits all \ncombined funds to the local field, which does the same.\n•The use of funds cannot be applied to purchase buildings, but the funds can be used for the \nfollowing, including: ministry expenses, wages of the global mission pioneer(s), equipment, rental of \nfacility for outreach or worship, and for training and equipping.\n•Closing down the project can happen in cases where the leaders moved away, the plan was \nunsuccessful, or for other reasons where the local field decides to discontinue the project. When this \nhappens, the annual plan and report still must be completed to avoid having the funds recalled. If the \nfunds were not all spent or accounted for, then just the remaining unused funds will be recalled.TRANS-EUROPEAN DIVISION\n2 INITIAL APPLICATION – to be completed once before the project starts, \nthen reviewed by all levels  \nStep 1: Please provide basic information abou t the proposed Global Mission Project. \nInitiating Organization [name of Mission , Conference, or Union]: \nProject description [two to three sentences]:  \nProject start date [estimated start date; if project has already begun, put a recent date]: \nName of local currency:  \nDoes this project require especially careful handling due to the political situation in the region ? \nStep 2: Indicate where this project will be conducted. \nWhat country is the project located in?  \nWhat city is the project located in?  \nProject name:  \nStep 3: Indicate the people this project seeks to reach [The duration of each project is three \nyears among a Christian context and five years among a non-Christian context (with seven years \nextension in special circumstances)]. \nReligious background: 3 TRANS-EUROPEAN DIVISION\nLanguage:  \nPeople group - hold CTRL ke y and select one or more groups that this project is seeking specifically to reach: \nAmong the people group you have chosen, is the Adventist church strongly-established, weakly \nestablished, or non-existent?  \nStep 4:  Please complete the initial project plan.  \nAnticipated first group meeting  [whethe r leadership team, small group, or Sabbath gathering]:\nAnticipated group meeting frequency  [of any type]:  \nNumber of Baptized Adventists   + Number of Non-Adventists = Total attendance  [in all weekly groups] : \nNumber of attendees from the focus people group: \nNumber of attendees living within 10km: \nLocal population within 10km:  \nNumber of baptized Adventists living within 10km (approximate): \nAdventist congregations within 10km:  \nBaptisms \nNumber of baptisms during last 12 months:  \nNumber of attending baptismal classes:  TRANS-EUROPEAN DIVISION\nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers to the following questions based upon the quote of Christ’s Method Alone from the book \nMinistry of Healing,  p.143] \nWhat is the expected outcome of this project? \nMingling:  How will the Global Mission Pioneer Church Planter(s) establish first contact with the \ncommunity?  \nSympathy/Meeting Needs: How will the Global Mission Pioneer Church Planter(s) learn the needs \nof the people? \nWinning Their Confidence: How will the Global Mission Pioneer Church Planter(s) build \nfriendships and trust among the people?  \nBid Them Follow:  How will the Global Mission Pioneer Church Planter(s) identify people with \nspiritual interest and then bridge the gap from meeting physical needs to meeting spiritual needs \nand introducing people to Jesus?  \nDiscipleship: What discipling methods will be used to grow new believers into fully committed \nSeventh-Day Adventists?  \nCultivating Leadership:  In what ways will leaders be developed to carry on this work after the \nGlobal Mission Pioneer Church Planter(s) leave?  \n4 TRANS-EUROPEAN DIVISION  \nMentorship and Training \nAnticipated pioneer church planter arrival date [if planter is already there, list the start date of the \nproject]:  \nList the names of the pioneer church planter(s) and provide a one or two sentence biography for \neach one:  \nDescribe the training plans for the pioneer church planter(s): \nSupervising mentor name:  \nPlanned mentor visits [per year]:  \nDirector Name [this person may or may not be the same as the supervising mentor]: \nDirector Email Address: \nRemuneration \nWill the Global Mission Pioneer Church Planter(s) be paid or volunteers [Pastors on full-time salary \ncan be involved in Global Mission projects if it is their primary responsibility]:  \nHow many pioneer church planters will be paid?  \nHow many pioneer church planters will be volunteers?  \nIn local currency, what is the yearly remuneration rate (100%)? [ask your treasurer] \n5 TRANS-EUROPEAN DIVISION\n6 What is a local pastor’s remuneratio n percentage ? [ask your treasurer] \nWhat is the remuneration percentage for Global Mission Pioneer Church Planters in this territory? \n[if planter is paid, use percentage of the wages based upon the 100% remuneration factor]\nIf needed, please explain the rationale behind your remuneration plan if the amount being paid is \nless than 80% [i.e. the planter is a volunteer or not a fully employed pastor]. \nStep 5: Please complete the initial budget for Year 1 in your local currency [general estimates are \nok; as long as the annual income and expenses balance, there is no penalty for actual expenses \nbeing slightly higher or lower in a particular category]. \nLine item  Explanation  Budget in local \ncurrency  \nSalaries  Salaries for pioneers  \nPioneer Benefits  Retirement, healthcare, insurance, etc.  \nHousing/Rent  Housing for pioneers  \nTraining Books, transport, lodging, per diem, etc.  \nPioneer \nAllowances  Travel, phone, internet, etc. \nProject Expenses  Advertising, supplies, etc. \nEquipment  Equipment such as a computer or projector \nfor pioneer use  \nLiterature  Bibles, health materials, etc. \nProject insurance  Liability insurance for the project  \nMeeting Place \nRent  Worship location rent (max 25% of pioneer \nsalary)  \nMiscellaneous  Other expenses not included above  TRANS-EUROPEAN DIVISION\n \n7 ANNUAL PLAN AND REPORT \nMeeting Frequency \nWhen will this group beg in to mee t regularly?  \nGroup meeting frequency: \nAttendance \nNumber o f Baptized Adventists :   + Number of Non-Adventists:   = Total attendance: \nNumber o f attendees from the focus people group: \nNumber o f attendees living within 10km:  \nLoca l population within 10km:  \nBaptisms \nNumber o f baptism s during last 12 months:  \nNumber attending baptismal classes:  \nTithe and Offering \nAnnual tithe amount (in local currency): \nAnnual offering amount from the local church (in local currency): \nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers to the following question based upon the quote of Christ’s Method Alone from the book \nMinistry of Healing,  p.143] \nWhat is the expected outcome o f this project? TRANS-EUROPEAN DIVISION  \n \nMingling: How will th e Global Missio n Pioneer Chu rch Planter( s) establi sh first contac t with the \ncommunity?  \nSympathy/Meeting Needs:  How will th e Global Missio n Pioneer Chu rch Planter( s) lea rn the needs \nof the people? \nWinning The ir Conf idence:  How will th e Global Missio n Pioneer Chu rch Planter( s) build \nfriendsh ips a nd trust a mong the people?  \nBid The m Foll ow: How wi ll the Global Missio n Pioneer Chu rch Planter( s) iden tify p eople with \nspiritual interes t and then bridge the gap from meetin g physical needs t o meetin g spiritual needs \nand introdu cing peop le to Jesus?  \nDiscipleship: Wha t discipling methods will b e used to g row new believers in to fully committed \nSeventh- Day Adventists?  \nCultivating Leadership: In wh at ways will leaders b e develope d to carry o n this work after the \nGlobal Missio n Pioneer Chu rch Planter( s) leave?  \n8 TRANS-EUROPEAN DIVISION\nProgress \nIf you plan to renew this proje ct, what missio n strategies will b e used during the next 12 months? \nWhat missio n challenges d id the Global Missio n Pioneer Chu rch Planter( s) face durin g the last 1 2 \nmonths?  \nWrite a paragrap h describ ing the activities o f the Global Missio n Pioneer Chu rch Planter( s) an d the \nprogress mad e toward startin g a n ew grou p of believe rs amon g this peop le grou p durin g the last 12 \nmonths .  \nTell one brie f story abou t the Global Missio n Pioneer Chu rch Plante rs’ experien ce from the last 12 \nmonths.  \nMentorship a nd Training  \nNumber of pioneer church planters working last 12 months: \nPioneer church planter(s) arrival date [if planter is already there, list the start date of the project]: \nList th e names o f the pioneer chu rch planter( s) an d provid e a one or two se ntenc e biography for \neach one: \n9 10 TRANS-EUROPEAN DIVISION  \nWhat trainin g events did the pioneer chu rch planter( s) atten d in t he past 12 mo nths: \nSupervi sing me ntor name: \nHow many times di d the supervi sing mentor visi t the pionee r chu rch planter( s) durin g the last 12 \nmonths?  \nDirector nam e [this pe rson ma y or may no t be the same as the supervisin g me ntor]: \nDirector ema il address:  \nFinance s [Cop y of previous year ’s budge t availab le upo n request] \nLine item  Explanation  Expenses in local \ncurrency  \nSalaries  Salaries for pioneers  \nPioneer Benefits  Retirement, healthcare, insurance, etc.  \nHousing/Rent  Housing for pioneers  \nTraining Books, transport, lodging, per diem, etc.  \nPioneer Allowances  Travel, phone, internet, etc. \nProject Expenses  Advertising, supplies, etc. \nEquipment  Equipment such as a computer or \nprojector for pioneer use  \nLiterature  Bibles, health materials, etc. \nProject insurance  Liability insurance for the project  \nMeeting Place Rent  Worship location rent (max 25% of \npioneer salary)  \nMiscellaneous  Other expenses not included above  ",
        "Funding-Deadlines-for-2024-25.pdf": "TED Adventist Mission 2024-2025 \nHere are deadlines for submitting any mission project proposals / funding requests to the TED \nMission Board. All application forms should be uploaded at \nted.adventist.org/departments/adventist-mission/  \n \nFriday 21 February 2025  for the Creative & Innovative Outreach Fund  (CIOF); all decisions will be \nmade during the 11 March Mission Board. \nFriday 21 February 2025  for the Mission Impact Fund; recommendations to the GC will be made \nduring the 11 March Mission Board.  \n11 November is the last Mission Board of the year for 2025 funding.  Therefore, all requests for \nfunding of 2025 projects must be submitted at the latest by 30 October 2025!  \n  \nThursday 31 October 2024  \nThursday 21 November 2024 \nThursday 9 January 2025 \nThursday 30 January 2025 \nThursday 27 February 2025 \nThursday 17 April 2025 \nThursday 1 May 2025 \nThursday 5 June 2025 \nThursday 21 August 2025 \nThursday 28 August 2025 \nThursday 4 September 2025 \nThursday 9 October 2025 \nThursday 30 October 2025 \nThursday 27 November 2025 \n  \n(for 12 November 2024 MB) \n(for 3 December 2024 MB) \n(for 21 January 2025 MB) \n(for 11 February 2025 MB) \n(for 11 March 2025 MB) \n(for 29 April 2025 MB) \n(for 13 May 2025 MB) \n(for 17 June 2025 MB) \n(for 2 September 2025 MB) \n(for 9 September 2025 MB) \n(for 16 September 2025 MB) \n(for 21 October 2025 MB) \n(for 11 November 2025 MB) \n(for 9 December 2025 MB) \n \n ",
        "MPS-instructions.pdf": "Mission Priority System instructions  \n \n \n Log in with your username and password on https://mps.adventist.org   and c lick on                        to \nstart a new project  \n Describe the project  \n Choose the physical location of the project  \n Choose the people group the project will focus on – the priority score (green —low, yellow —\nmedium, high —red) refers to the Global Mission priority of reaching a particular people \ngroup; the higher the Global Mission priority, the higher the amount of funding Global Mis-\nsion is able to give to the project  \n Enter all of the relevant details and plans for the project  \n Enter the budget for the project – majority of the expenses should be relating to people, rather \nthan buildings/equipment  \n Identify other funding sources  \n Submit the project for review  \n Each entity that will be involved with the project will review the project  \n Global Mission at the General Conference will enter the amount of their funding contribution, fol-\nlowed by the division and union; finally, the conference/mission will provide the remaining funding \namount. In the case of wrong funding commitment, re -evaluation by all entities is required and the \nfund commitment process starts again.  \n Each level of the organisation participating in the project will take the project to the appropriate \ncommittee for voting; they will then record the minute number, committee name and date of vote \ninto the system  \n The GC, division and union will each send the funding (as per that month ’s exchange rates which will \nstay locked for the fiscal cycle for that project) and each entity will confirm when the funding has \nbeen received on the MPS system by noting the Journal Voucher number on the system (available \nfrom your treasurer)  \n The project is marked with status “In Progress ” \n Projects have a 12 months cycle (fiscal year) that can begin at any point during the year and this \nstarts whenever a project is approved and voted by the General Conference; 10 -12 months later, an \nalert will flag the project to notify you that reports are due; another alert will show when reports \nare so far overdue that this has initiated a recall of funding warning  \n When you start the year -end process, MPS system will prompt you to complete a report form \n(similar to the application form you completed)  \n You will then enter the next year ’s budget  \n You will identify other funding sources  \n Every time you log in and click on a project, you are taken \nto the only Action page where you can initiate action \nneeded for the project (if there is any); all the other pages \nare for viewing only and cannot be changed after the ini-\ntial stage; click on the “Return to action” button to return to the action page if you have \nviewed any of other information (Overview/Location/Plans and reports/Remuneration/\nAnnual budgets etc.)  \n PIONEERS – Global Mission pioneers are the people who are actively charged with planting \na new church or group (elders or active volunteers). Pioneer church planters work in teams \nof at least two people, and ideally are paid a stipend to enable them to work full -time on \nthe project.  \n MESSAGING – the system includes a module for messaging within each project – click on \nthe Messages button on the left to send a message which will be recorded in the Messages \nlog and emailed to the appropriate level  \n TAGS/NOTES – you can add personal tags and notes to your projects for your own conven-\nience which only you will be able to see  \n FLAGS show which entity needs to work on the project – G is for GC, D is for division, U is \nfor union and C is for conference or mission  \n STATUS – statuses are the stage at which your project is at the moment and are easily iden-\ntifiable by their wording  \n ACTIVITY LOG – within each project you can find a button called Activity Log on the left \nhand side of your screen – this is the way for you to track who has made any changes on \nthe project and any other activity   \n PROJECT DURATION – Typically, projects among people groups with a Christian worldview \nbegin with a three -year duration, while projects among groups with another worldview \nbegin with a five -year duration  \n SYSTEM DIGESTS – you will receive periodic emails from the system alerting you to projects \nneeding your attention  \n When each organisation reviews the project plan or report, if necessary you can send it \nback for changes by using the “Return for changes” button; after approving a plan/report, \nit is not possible to return the project for changes  \n USERS – to add a user, click on Manage Users at the bottom of the any page, click on Add \nUser on the left and enter the user’s details. System managers at each level of the organi-\nsation can set up and manage users at their own organisation and the organisation below \nthem.  \n There is no way for you to log out from the MPS system at the moment – please use a dif-\nferent internet browser in case you would like to log in with a second account on the same \ndevice  \n \n \nIf you have any questions about a specific project, send a message through the messages \nbutton after opening the project. If you have a question about the system in general unre-\nlated to a specific project, use the Request Help option at the top of the screen.  \nFor any additional help, please contact Zina Tsvetanova ( ztsvetanova@ted.adventist.org ) \n",
        "Overview-Packet-TED-MB-Funds-updated-031223Jan24.pdf": "TED Mission Board \nFunding Processes Overview \n2023-2024\nSeventh -day Adventist  Church \nTRANS EUROPEAN DIVISION  \n119 ST PETER’S  STREET,  ST ALBANS,  ENGLAND,  AL1 3EY \nUNITED  KINGDOM  \nPHONE  +44 1727  732 500 \nwww.ted.adventist.org  1 \nTable  of Contents  \n0.OVERVIEW  TABLE  ................................ ................................ .....................  page  2 \n1.GLOBAL  MISSION  CHURCH  PLANTING  ................................ ..............  pages  3-8 \n2.URBAN CENTRES  OF INFLUENCE  (UCI)  ................................ ................ pages  9-13 \n3.TED  MISSION  BOARD  PROJECTS  ................................ ........................  pages  14-15 \n4.TED  CREATIVE  AND  INNOVATIVE  OUTREACH  FUND  (CIOF)  .... pages  16-17 \n5.GC MISSION  IMPACT  FUND  ................................ ................................ .. page  18 \n2 \nOVERVIEW  TABLE\nAll applications  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). \n  3 \n1 GLOBAL  MISSION  CHURCH  PLANTING  FORMS  \nHow  to use  this form  \nThis form contains two parts – the Initial Application [pages 4-6] and the Annual Plan and Report \n[pages 7-8]. The Annual plan and report must be completed after the funds are spent and before the \nfollowing year’s funds can  be sent. To  download a fillable version of this form and  receive more  info \nabout  Global  Mission,  please visit ted.adventist.org/departments/adventist -mission  \nOverview  \nPlease have the church  planter(s) complete the  relevant portion of  the form.  After  completion,  the planter(s) \nreturns the form to the Adventist Mission coordinator/director in their field who enters the date in the online \nglobal mission database (mps.adventist.org ). As an alternative serv ice, this form can be uploaded at \nted.adventist.org/departments/adventist -mission  and the data entered by TED A dventist Mission on behalf \nof the local field.  \nNotes  \n•If the Annual  plan and report  is not completed  by the local field and approved  by all levels  within\n12 months, the General Conference will recall the funds!\n•The duration  of each  project  is three  years  among  a Christian  context  and five years  among  a\nnon-Christian context [with seven years extension in special circumstances]. Initial applications\ncan be made at any time during the calendar year, but the official start date for the fiscal\nyear of each plant is when the General Conference c ommits funds.\n•The percentage  of annual  funding  levels  from the General  Conference  and TED stays  the\nsame throughout the duration of the project .\n•The Annual Funding Process is as follows: The GC votes funds and credits them to the TED.\nThen the  TED votes  their contribution  in addition  to the GC contribution  and credits  the combined\namount  to the Union. Then the Union votes their contribution which is added to the GC & TED and\ncredits all combined funds to the local field, which does the same.\n•The use of funds cannot be applied to purchase buildings, but the funds can be used for the\nfollowing,  including:  ministry  expenses,  wages  of the global  mission  pioneer(s),  equipment,\nrental  of facility for outreach or worship, and for training and equipping.\n•Closing down the project can happen in cases where the leaders moved away, the plan was\nunsuccessful, or  for other reasons where  the local field decides  to discontinue the  project.  When\nthis happens,  the annual  plan and report still  must be  completed  to avoid  having  the funds\nrecalled. If  the funds were not all spent or accounted for, then just the remaining unused funds\nwill be recalled.4 \nINITIAL APPLICATION – to be completed once before the project  \nstarts, then reviewed by all levels  \nStep  1: Please  provide  basic  information  about  the proposed  Global  Mission  Project. \nInitiating Organization [name of Mission, Conference, or Union]:  \nProject  description  [two to three  sentences]:  \nProject  start date [estimated  start date;  if project  has already  begun,  put a recent  date]:  \nName  of local currency:  \nDoes  this project  require  especially  careful  handling  due to the political  situation  in the region?  \nStep  2: Indicate  where  this project  will be conducted. \nWhat country is the project located in?  \nWhat  city is the project  located  in? \nProject name:  \nStep 3: Indicate the people this project seeks to reach [The duration of each project is three \nyears  among  a Christian  context  and five years  among  a non-Christian  context  (with  seven  \nyears extension in special circumstances)].  \nReligious  background:  \nLanguage:  \nPeople  group  - hold CTRL  key and select  one or more  groups  that this project  is seeking  specifically to  reach: \nAmong  the people  group you  have  chosen,  is the Adventist  church  strongly -established,  weakly \nestablished, or non -existent?  \nStep  4: Please  complete  the initial  project  plan.  \nAnticipated  first group  meeting  [whether leadership team, small group or Sabbath gathering]:  \nAnticipated group meeting frequency  [of any type]:\nNumber  of Baptized  Adventists  + Number  of Non-Adventists  = Total  attendance  [in all weekly  groups] : \n  Number  of attendees  from the focus  people  group:  5 \nNumber of attendees living within 10km:  \nLocal  population  within  10km:  \nNumber  of baptized  Adventists  living  within  10km  (approximate): \nAdventist congregations within 10km:  \nBaptisms  \nNumber  of baptisms  during  last 12 months:  \nNumber of attending baptismal classes : \nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers  to the following  questions  based  upon  the quote  of Christ’s  Method  Alone  from the book \nMinistry of Healing, p.143]  \nWhat  is the expected  outcome  of this project?  \nMingling:  How will the Global  Mission  Pioneer  Church  Planter(s)  establish  first contact  with the \ncommunity?  \nSympathy/Meeting  Needs:  How will the Global  Mission  Pioneer  Church  Planter(s)  learn  the \nneeds of the people?  \nWinning  Their  Confidence:  How will the Global  Mission  Pioneer  Church  Planter(s)  build \nfriendships and trust among the people?  \nBid Them Follow: How will the Global Mission Pioneer Church Planter(s) identify people \nwith spiritual  interest  and then bridge  the gap from meeting  physical  needs  to meeting  \nspiritual  needs and intr oducing people to Jesus?  \nDiscipleship:  What  discipling  methods  will be used  to grow  new believers  into fully  \ncommitted Seventh -Day Adventists?  \nCultivating  Leadership:  In what  ways  will leaders  be developed  to carry  on this work  after \nthe Global Mission Pioneer Church Planter(s) leave?  \nMentorship  and Training  \nAnticipated  pioneer  church  planter  arrival  date [if  planter  is already  there,  list the start date of the \nproject]:  \nList the names  of the pioneer  church  planter(s)  and provide  a one or two sentence  biography  \nfor each one:  \nDescribe  the training  plans  for the pioneer  church  planter(s):  6 \nSupervising  mentor  name:  \nPlanned  mentor visits [per year]:  \nDirector  Name  [this person  may or may not be the same  as the supervising  mentor]:  \nDirector  Email  Address:  \nRemuneration  \nWill the Global  Mission  Pioneer  Church  Planter(s)  be paid or volunteers  [Pastors  on full-time \nsalary can be involved in Global Mission projects if it is their primary responsibility]:  \nHow many  pioneer  church  planters  will be paid?  \nHow many  pioneer  church  planters  will be volunteers?  \nIn local currency,  what  is the yearly  remuneration  rate (100%)?  [ask your treasurer]  \n  What  is a local pastor’s  remuneration  percentage?  [ask your treasurer]  \nWhat  is the remuneration  percentage  for Global  Mission  Pioneer  Church  Planters  in this \nterritory? [ if planter is paid,  use percentage of the wages based upon the 100% remuneration factor ] \nIf needed,  please  explain  the rationale  behind  your remuneration  plan if the amount  being  \npaid is less than 80% [i.e. the planter is a volunteer or not a fully employed pastor].  \nStep  5: Please  complete  the initial  budget  for Year  1 in your local currency  [general  estimates  \nare ok; as long as the annual income and expenses bala nce, there is no penalty for actual \nexpenses being slightly higher or lower in a particular category].  \nLine item Explanation  Budget  in local \ncurrency  \nSalaries  Salaries  for pioneers  \nPioneer  Benefits  Retirement,  healthcare,  insurance,  etc. \nHousing/Rent  Housing  for pioneers  \nTraining  Books,  transport,  lodging,  per diem,  etc. \nPioneer \nAllowances  Travel,  phone,  internet,  etc. \nProject Expenses  Advertising,  supplies,  etc. \nEquipment  Equipment  such  as a computer  or projector \nfor pioneer use  \nLiterature  Bibles,  health  materials,  etc. \nProject insurance  Liability  insurance  for the project  \nMeeting  Place \nRent Worship  location  rent (max  25% of pioneer \nsalary)  \nMiscellaneous  Other  expenses  not included  above  7 \nANNUAL  PLAN AND  REPORT  \nMeeting  Frequency  \nWhen  will this group  begin  to meet  regularly? \nGroup meeting frequency:  \nAttendance  \nNumber  of Baptized  Adventists:  + Number  of Non-Adventists:   = Total  attendance:  \nNumber  of attendees  from the focus  people  group:  \nNumber  of attendees  living  within  10km:  \nLocal  population  within  10km:  \nBaptisms  \nNumber  of baptisms  during  last 12 months:  \nNumber  attending  baptismal  classes:  \nTithe  and Offering  \nAnnual  tithe amount  (in local currency):  \nAnnual  offering  amount  from the local church  (in local currency):  \nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers  to the following  question  based  upon  the quote  of Christ’s  Method  Alone  from the book \nMinistry of Healing, p.143]  \nWhat  is the expected  outcome of  this project?  \nMingling:  How will the Global  Mission  Pioneer  Church  Planter(s)  establish  first contact  with the \ncommunity?  \nSympathy/Meeting  Needs: How will the Global  Mission  Pioneer  Church  Planter(s)  learn  the \nneeds of the people?  \nWinning  Their  Confidence:  How will the Global  Mission  Pioneer  Church  Planter(s)  build \nfriendships and trust among the people?  \nBid Them Follow: How will the Global Mission Pioneer Church Planter(s) identify people \nwith spiritual  interest  and then bridge  the gap from meeting  physical  needs  to meeting  \nspiritual  needs and introducing people to Jesus?  \nDiscipleship:  What  discipling  methods  will be used  to grow  new believers  into fully \ncommitted Seventh -Day Adventists?  \nCultivating  Leadership:  In what  ways  will leaders  be developed  to carry  on this work  after \nthe Global Mission Pioneer Church Planter(s) leave?  8 \nProgress  \nIf you plan to renew  this project,  what  mission  strategies  will be used  during  the next 12 months?  \nWhat  mission  challenges  did the Global  Mission  Pioneer  Church  Planter(s)  face during  the last 12 \nmonths?  \nWrite a paragraph describing the activities of the Global Mission Pioneer Church Planter(s) and \nthe progress  made  toward  starting  a new group  of believers  among  this people  group during  the \nlast 12 months.  \nTell one brief story  about  the Global  Mission  Pioneer  Church  Planters’  experience  from the last 12 \nmonths.  \nMentorship  and Training  \nNumber  of pioneer  church  planters  working  last 12 months:  \nPioneer  church  planter( s) arrival  date [if planter  is already  there,  list the start date of the project]:  \nList the names  of the pioneer  church  planter(s)  and provide  a one or two sentence  biography  \nfor each one:  \n  What  training  events  did the pioneer  church  planter(s)  attend  in the past 12 months:  \nSupervising  mentor  name:  \nHow many  times  did the supervising  mentor  visit the pioneer church  planter(s)  during  the \nlast 12 months?  \nDirector  name  [this person  may or may not be the same  as the supervising  mentor]:  \nDirector  email  address:  \nFinances  [Copy  of previous  year’s  budget  available  upon  request]  \nLine item Explanation  Expenses  in local \ncurrency  \nSalaries  Salaries  for pioneers  \nPioneer  Benefits  Retirement,  healthcare,  insurance,  etc. \nHousing/Rent  Housing  for pioneers  \nTraining  Books,  transport,  lodging,  per diem,  etc. \nPioneer  Allowances  Travel,  phone,  internet,  etc. \nProject Expenses  Advertising,  supplies,  etc. \nEquipment  Equipment  such  as a computer  or \nprojector for pioneer use  \nLiterature  Bibles,  health  materials,  etc. \nProject insurance  Liability  insurance  for the project  \nMeeting  Place  Rent Worship  location  rent (max  25% of \npioneer salary)  \nMiscellaneous  Other  expenses  not included  above  9 \n2 APPLICATION  FOR URBAN  CENTRE  OF INFLUENCE  (UCI) \nOverview  \n•Download  the application  from the GC at urbancenters.org/application  and receive more\ninformation regarding guidelines, application, business plan checklist, etc. For reference\n(pages 1 0-13)\n•Use of funds: funds cannot be used to purchase buildings, but can be partially used\ntowards rental or remode ling.\n•Approval process: Regular communication  between all levels regarding strategy , long-\nterm viability  and funding commitment by local missions/conferences and unions is\nrequired before application goes to TED Mission  Board .\n•Top applications worldwide: The applications that the General Conference ends up\nselecting are not simply the best from a given division but from all applicants worldwide .\n•For consultation  of project  ideas , contact Anthony WagenerSmith at\nawagenersmith@ted.adventist.org .\n•Submit application  at ted.adventist.org/departments/adventist -mission\n•Receiving funds : After approval by GC Mission Board, GC funds are credited to the TED\nwhich —along  with each  level—adds  its yearly  contributions  and credits  the totals  through\nthe system to the local project .\n•Reports:  Annual  ministry  and financial  reports  must  be submitted  by the local field\nand approved by all levels before the additional year’s funding is sent .\nApplicati on \nThe following  application  can be downloaded  at \nurbancenters.org/application  10 \n11 \n12 \n13 \n14 \n3 APPLICATION  FOR TED MISSION  BOARD  PROJECT  \nHow  to use this form  \n•Download  and submit  the application online at ted.adventist.org/departments/adventist -\nmission\n•The application  contains  four steps  – Basic  Information,  Project  Description,  Budget\nRequest and Project Funding .\nOverview  \n•Preparation  of application:  Local  field and union  must  approve  the application  before\nunion submits to TED. After submission, there is communication with the Adventist\nMission department before possible vote by the Mission Board .\n•Financial  participation : mandatory  at all levels  except  GC.\n•Follow -up communication : applicants  will be informed  of application  outcome .\n•Receiving  funds : After  project  vote,  TED’s  contribution  is credited  to the  union  who—\nalong with each level —adds and credits its contribution towards the project .\n•Report:  A basic  report  must  be submitted  online  by the project  director  within twelve\nmonths of receiving the funds (ted.adventist.org/departments/adventist -mission )\nStep  1: Basic  information  \nYear  of the outreach:  Country:  \nProject title: City/Town:  \nProject Director name:  People Group:  \nProject Director email address: Estimate Population in People Group: \nOrganisation responsible:  Estimate of SDA Presence:  \nStep  2: Project  Description  \nWhen you make the actual application online, the applicant will attach their own project description \nincluding details on preparation, conducting the outreach initiative, and a follow -up process.  15 \nStep  3: Budget  request  \nBudget  request  in local  currency  \nDescription  Amount  \nItem 1: \nItem 2: \nItem 3: \nItem 4: \nItem 5: \nItem 6: \nItem 7: \nItem 8: \nItem 9: \nItem 10: \nItem 11: \nItem 12: \nTotal:  \nStep  4: Project  Funding  \nBudget  contribution  in local  currency  \nLocal  church:  \nConference/Mission:  \nUnion:  \nDivision  funding  requested:  \nTotal:  \nThis application  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). Name of local currency:\nName of local currency:16 \n4 APPLICATION FOR CREATIVE AND INNOVATIVE OUTREACH\nFUND (CIOF)\nHow  to use this form  \n•Download a nd submit  the application online at  ted.adventist .org/departments/adventist -\nmission\n•The application  contains  four steps  – Basic  Information,  Project  Description,  Budget\nRequest and Project Funding .\nOverview  \n•Purpose: The CIOF fund exists to enable local churches to fund missional projects that \nhave not been tried before (i.e. sports, arts, media, business, education, etc.). The total \nfund of £32,000 is spread across the top applications each year.\n•When to apply: All applications must be submitted online by 1 March, 2024,\nfor consideration by the March TED Mission Board.\n•Preparation of application: After application submission, there is communication with \nthe Adventist Mission department before possible vote by the Mission Board.\n•Follow-up communication: applicants will be informed of application outcome.\n•Receiving funds: After project vote, TED’s contribution is credited to the union who—\nalong with each level —adds and credits its contribution towards the project.\n•Report: A basic report must be submitted online by the project director within twelve \nmonths of receiving the funds (ted.adventist.org/departments/adventist-mission ).\nStep  1: Basic  information  \n Year  of the outreach:    Country:  \n Project title:    City/Town:  \n Project Director name:    People  Group:\n Project  Director  email  address:    Estimate  Population  in People  Group:  \n   Organisation  responsible:  Estimate  of SDA Presence:  \nStep  2: Project  Description  \nWhen you make the actual application online, the applicant will attach their own project description \nincluding details on preparation , conducting the outreach initiative , and a follow-up process. 17 \nStep  3: Budget  request  \nBudget  request  in local  currency  \nDescription  Amount  \nItem 1: \nItem 2: \nItem 3: \nItem 4: \nItem 5: \nItem 6: \nItem 7: \nItem 8: \nItem 9: \nItem 10: \nItem 11: \nItem 12: \nTotal:  \nStep  4: Project  Funding  \nBudget  contribution  in local  currency  \nLocal  church:  \nConference/Mission:  \nUnion:  \nDivision  funding  requested:  \nTotal:  \nThis application  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). Name of local currency:\nName of local currency:18 \n5 APPLICATION  FOR  GC MISSION  IMPACT  FUND \nHow  to use this form  \n•Download the application – once made available by the GC - at\nted.adventist.org/departments/adventist-mission\n•Preparation of application: Local field and union must approve the application\nbefore union submits to TED.\n•Top applications worldwide: The applications that the General Conference ends up \nselecting are not simply the best from a given division but from all applicants worldwide.\n•Submit application online at ted.adventist.org/departments/adventist-mission\nno later than 1 March, 2024.\nPurpose  of Fund  \n•I Will Go!: The General Conference strategy “I Will Go!” envisions every level of the\nchurch—including local churches —to be actively engaged i n expressing its KPI’s, or\n“key performance indicators”. These can be viewed at iwillgo2020.org\n•Alignment of Financial Resources with KPI’s: The General Conference created this\nfund to allocate financial resources specifically to local churches or schools who are doing\nfrontline mission that fulfils one or more GC KPI’s .\n•Project Examples: In addition to existing churches, other applications could be for\nchurch planting, school planting (or evangelism through an existing school), and other\nfrontline projects. For more info regarding the fund’s purpose and past examples, visit\nwillplan.org/services/missionimpactfund\n•Financial Amounts: As a general estimate, applications should range from between\n$30,000 - $100,000 and can be spread out over two years.\nProcess  after  Application  Submission  \n•TED Mission Board Recommends Fifteen Projects: At a following TED Mission Board\nafter the 1 March deadline, a maximum of fifteen projects will be voted to recommend to\nthe General Conference for consideration. Applicants will be informed if any additional\ninformation is needed before the TED Mission Board, and the outcome if their project is\nrecommended or not.\n•GC Votes Mission Impact Projects: The relevant GC board takes recommendations\nfrom TED and votes which projects it will approve.\n•Receiving funds: Once a project is approved, the GC credits the funds to the TED, which\ncredits funds to the Union, and local conference or mission (where relevant) before\nreaching the local church. For multi-year projects, it is within the discretion o f the TED to\nrelease partial funds year by year.\n•Report: A mission and financial report must be completed by each project which will\nbe provided from the GC.",
         "Contacts": "For more information contact Zina Tsvetanova ztsvetanova@ted.adventist.org\nThe Director of Adventist Mission at TED is Anthony WagnerSmith.\nAnthony WagnerSmith email is awagenersmith@ted.adventist.org, phone is +44-1727 732 500",
		"Overview-Packet-TED-MB-Funds.pdf": "TED Mission Board \nFunding Processes Overview \n2024-2025\nSeventh -day Adventist  Church \nTRANS EUROPEAN DIVISION  \n119 ST PETER’S  STREET,  ST ALBANS,  ENGLAND,  AL1 3EY \nUNITED  KINGDOM  \nPHONE  +44 1727  732 500 \nwww.ted.adventist.org  1 \nTable  of Contents  \n0.OVERVIEW  TABLE  ................................ ................................ .....................  page  2 \n1.GLOBAL  MISSION  CHURCH  PLANTING  ................................ ..............  pages  3-8 \n2.URBAN CENTRES  OF INFLUENCE  (UCI)  ................................ ................ pages  9-13 \n3.TED  MISSION  BOARD  PROJECTS  ................................ ........................  pages  14-15 \n4.TED  CREATIVE  AND  INNOVATIVE  OUTREACH  FUND  (CIOF)  .... pages  16-17 \n5.GC MISSION  IMPACT  FUND  ................................ ................................ .. page  18 \n2 \nOVERVIEW  TABLE\nAll applications  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). \n  3 \n1 GLOBAL  MISSION  CHURCH  PLANTING  FORMS  \nHow  to use  this form  \nThis form contains two parts – the Initial Application [pages 4-6] and the Annual Plan and Report \n[pages 7-8]. The Annual plan and report must be completed after the funds are spent and before the \nfollowing year’s funds can  be sent. To  download a fillable version of this form and  receive more  info \nabout  Global  Mission,  please visit ted.adventist.org/departments/adventist -mission  \nOverview  \nPlease have the church  planter(s) complete the  relevant portion of  the form.  After  completion,  the planter(s) \nreturns the form to the Adventist Mission coordinator/director in their field who enters the date in the online \nglobal mission database (mps.adventist.org ). As an alternative serv ice, this form can be uploaded at \nted.adventist.org/departments/adventist -mission  and the data entered by TED A dventist Mission on behalf \nof the local field.  \nNotes  \n•If the Annual  plan and report  is not completed  by the local field and approved  by all levels  within\n12 months, the General Conference will recall the funds!\n•The duration  of each  project  is three  years  among  a Christian  context  and five years  among  a\nnon-Christian context [with seven years extension in special circumstances]. Initial applications\ncan be made at any time during the calendar year, but the official start date for the fiscal\nyear of each plant is when the General Conference c ommits funds.\n•The percentage  of annual  funding  levels  from the General  Conference  and TED stays  the\nsame throughout the duration of the project .\n•The Annual Funding Process is as follows: The GC votes funds and credits them to the TED.\nThen the  TED votes  their contribution  in addition  to the GC contribution  and credits  the combined\namount  to the Union. Then the Union votes their contribution which is added to the GC & TED and\ncredits all combined funds to the local field, which does the same.\n•The use of funds cannot be applied to purchase buildings, but the funds can be used for the\nfollowing,  including:  ministry  expenses,  wages  of the global  mission  pioneer(s),  equipment,\nrental  of facility for outreach or worship, and for training and equipping.\n•Closing down the project can happen in cases where the leaders moved away, the plan was\nunsuccessful, or  for other reasons where  the local field decides  to discontinue the  project.  When\nthis happens,  the annual  plan and report still  must be  completed  to avoid  having  the funds\nrecalled. If  the funds were not all spent or accounted for, then just the remaining unused funds\nwill be recalled.4 \nINITIAL APPLICATION – to be completed once before the project  \nstarts, then reviewed by all levels  \nStep  1: Please  provide  basic  information  about  the proposed  Global  Mission  Project. \nInitiating Organization [name of Mission, Conference, or Union]:  \nProject  description  [two to three  sentences]:  \nProject  start date [estimated  start date;  if project  has already  begun,  put a recent  date]:  \nName  of local currency:  \nDoes  this project  require  especially  careful  handling  due to the political  situation  in the region?  \nStep  2: Indicate  where  this project  will be conducted. \nWhat country is the project located in?  \nWhat  city is the project  located  in? \nProject name:  \nStep 3: Indicate the people this project seeks to reach [The duration of each project is three \nyears  among  a Christian  context  and five years  among  a non-Christian  context  (with  seven  \nyears extension in special circumstances)].  \nReligious  background:  \nLanguage:  \nPeople  group  - hold CTRL  key and select  one or more  groups  that this project  is seeking  specifically to  reach: \nAmong  the people  group you  have  chosen,  is the Adventist  church  strongly -established,  weakly \nestablished, or non -existent?  \nStep  4: Please  complete  the initial  project  plan.  \nAnticipated  first group  meeting  [whether leadership team, small group or Sabbath gathering]:  \nAnticipated group meeting frequency  [of any type]:\nNumber  of Baptized  Adventists  + Number  of Non-Adventists  = Total  attendance  [in all weekly  groups] : \n  Number  of attendees  from the focus  people  group:  5 \nNumber of attendees living within 10km:  \nLocal  population  within  10km:  \nNumber  of baptized  Adventists  living  within  10km  (approximate): \nAdventist congregations within 10km:  \nBaptisms  \nNumber  of baptisms  during  last 12 months:  \nNumber of attending baptismal classes : \nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers  to the following  questions  based  upon  the quote  of Christ’s  Method  Alone  from the book \nMinistry of Healing, p.143]  \nWhat  is the expected  outcome  of this project?  \nMingling:  How will the Global  Mission  Pioneer  Church  Planter(s)  establish  first contact  with the \ncommunity?  \nSympathy/Meeting  Needs:  How will the Global  Mission  Pioneer  Church  Planter(s)  learn  the \nneeds of the people?  \nWinning  Their  Confidence:  How will the Global  Mission  Pioneer  Church  Planter(s)  build \nfriendships and trust among the people?  \nBid Them Follow: How will the Global Mission Pioneer Church Planter(s) identify people \nwith spiritual  interest  and then bridge  the gap from meeting  physical  needs  to meeting  \nspiritual  needs and intr oducing people to Jesus?  \nDiscipleship:  What  discipling  methods  will be used  to grow  new believers  into fully  \ncommitted Seventh -Day Adventists?  \nCultivating  Leadership:  In what  ways  will leaders  be developed  to carry  on this work  after \nthe Global Mission Pioneer Church Planter(s) leave?  \nMentorship  and Training  \nAnticipated  pioneer  church  planter  arrival  date [if  planter  is already  there,  list the start date of the \nproject]:  \nList the names  of the pioneer  church  planter(s)  and provide  a one or two sentence  biography  \nfor each one:  \nDescribe  the training  plans  for the pioneer  church  planter(s):  6 \nSupervising  mentor  name:  \nPlanned  mentor visits [per year]:  \nDirector  Name  [this person  may or may not be the same  as the supervising  mentor]:  \nDirector  Email  Address:  \nRemuneration  \nWill the Global  Mission  Pioneer  Church  Planter(s)  be paid or volunteers  [Pastors  on full-time \nsalary can be involved in Global Mission projects if it is their primary responsibility]:  \nHow many  pioneer  church  planters  will be paid?  \nHow many  pioneer  church  planters  will be volunteers?  \nIn local currency,  what  is the yearly  remuneration  rate (100%)?  [ask your treasurer]  \n  What  is a local pastor’s  remuneration  percentage?  [ask your treasurer]  \nWhat  is the remuneration  percentage  for Global  Mission  Pioneer  Church  Planters  in this \nterritory? [ if planter is paid,  use percentage of the wages based upon the 100% remuneration factor ] \nIf needed,  please  explain  the rationale  behind  your remuneration  plan if the amount  being  \npaid is less than 80% [i.e. the planter is a volunteer or not a fully employed pastor].  \nStep  5: Please  complete  the initial  budget  for Year  1 in your local currency  [general  estimates  \nare ok; as long as the annual income and expenses bala nce, there is no penalty for actual \nexpenses being slightly higher or lower in a particular category].  \nLine item Explanation  Budget  in local \ncurrency  \nSalaries  Salaries  for pioneers  \nPioneer  Benefits  Retirement,  healthcare,  insurance,  etc. \nHousing/Rent  Housing  for pioneers  \nTraining  Books,  transport,  lodging,  per diem,  etc. \nPioneer \nAllowances  Travel,  phone,  internet,  etc. \nProject Expenses  Advertising,  supplies,  etc. \nEquipment  Equipment  such  as a computer  or projector \nfor pioneer use  \nLiterature  Bibles,  health  materials,  etc. \nProject insurance  Liability  insurance  for the project  \nMeeting  Place \nRent Worship  location  rent (max  25% of pioneer \nsalary)  \nMiscellaneous  Other  expenses  not included  above  7 \nANNUAL  PLAN AND  REPORT  \nMeeting  Frequency  \nWhen  will this group  begin  to meet  regularly? \nGroup meeting frequency:  \nAttendance  \nNumber  of Baptized  Adventists:  + Number  of Non-Adventists:   = Total  attendance:  \nNumber  of attendees  from the focus  people  group:  \nNumber  of attendees  living  within  10km:  \nLocal  population  within  10km:  \nBaptisms  \nNumber  of baptisms  during  last 12 months:  \nNumber  attending  baptismal  classes:  \nTithe  and Offering  \nAnnual  tithe amount  (in local currency):  \nAnnual  offering  amount  from the local church  (in local currency):  \nStrategy [Your strategy can be in whatever form is best, but the General Conference requires \nanswers  to the following  question  based  upon  the quote  of Christ’s  Method  Alone  from the book \nMinistry of Healing, p.143]  \nWhat  is the expected  outcome of  this project?  \nMingling:  How will the Global  Mission  Pioneer  Church  Planter(s)  establish  first contact  with the \ncommunity?  \nSympathy/Meeting  Needs: How will the Global  Mission  Pioneer  Church  Planter(s)  learn  the \nneeds of the people?  \nWinning  Their  Confidence:  How will the Global  Mission  Pioneer  Church  Planter(s)  build \nfriendships and trust among the people?  \nBid Them Follow: How will the Global Mission Pioneer Church Planter(s) identify people \nwith spiritual  interest  and then bridge  the gap from meeting  physical  needs  to meeting  \nspiritual  needs and introducing people to Jesus?  \nDiscipleship:  What  discipling  methods  will be used  to grow  new believers  into fully \ncommitted Seventh -Day Adventists?  \nCultivating  Leadership:  In what  ways  will leaders  be developed  to carry  on this work  after \nthe Global Mission Pioneer Church Planter(s) leave?  8 \nProgress  \nIf you plan to renew  this project,  what  mission  strategies  will be used  during  the next 12 months?  \nWhat  mission  challenges  did the Global  Mission  Pioneer  Church  Planter(s)  face during  the last 12 \nmonths?  \nWrite a paragraph describing the activities of the Global Mission Pioneer Church Planter(s) and \nthe progress  made  toward  starting  a new group  of believers  among  this people  group during  the \nlast 12 months.  \nTell one brief story  about  the Global  Mission  Pioneer  Church  Planters’  experience  from the last 12 \nmonths.  \nMentorship  and Training  \nNumber  of pioneer  church  planters  working  last 12 months:  \nPioneer  church  planter( s) arrival  date [if planter  is already  there,  list the start date of the project]:  \nList the names  of the pioneer  church  planter(s)  and provide  a one or two sentence  biography  \nfor each one:  \n  What  training  events  did the pioneer  church  planter(s)  attend  in the past 12 months:  \nSupervising  mentor  name:  \nHow many  times  did the supervising  mentor  visit the pioneer church  planter(s)  during  the \nlast 12 months?  \nDirector  name  [this person  may or may not be the same  as the supervising  mentor]:  \nDirector  email  address:  \nFinances  [Copy  of previous  year’s  budget  available  upon  request]  \nLine item Explanation  Expenses  in local \ncurrency  \nSalaries  Salaries  for pioneers  \nPioneer  Benefits  Retirement,  healthcare,  insurance,  etc. \nHousing/Rent  Housing  for pioneers  \nTraining  Books,  transport,  lodging,  per diem,  etc. \nPioneer  Allowances  Travel,  phone,  internet,  etc. \nProject Expenses  Advertising,  supplies,  etc. \nEquipment  Equipment  such  as a computer  or \nprojector for pioneer use  \nLiterature  Bibles,  health  materials,  etc. \nProject insurance  Liability  insurance  for the project  \nMeeting  Place  Rent Worship  location  rent (max  25% of \npioneer salary)  \nMiscellaneous  Other  expenses  not included  above  9 \n2 APPLICATION  FOR URBAN  CENTRE  OF INFLUENCE  (UCI) \nOverview  \n•Download  the application  from the GC at urbancenters.org/application  and receive more\ninformation regarding guidelines, application, business plan checklist, etc. For reference\n(pages 1 0-13)\n•Use of funds: funds cannot be used to purchase buildings, but can be partially used\ntowards rental or remode ling.\n•Approval process: Regular communication  between all levels regarding strategy , long-\nterm viability  and funding commitment by local missions/conferences and unions is\nrequired before application goes to TED Mission  Board .\n•Top applications worldwide: The applications that the General Conference ends up\nselecting are not simply the best from a given division but from all applicants worldwide .\n•For consultation  of project  ideas , contact Anthony WagenerSmith at\nawagenersmith@ted.adventist.org .\n•Submit application  at ted.adventist.org/departments/adventist -mission\n•Receiving funds : After approval by GC Mission Board, GC funds are credited to the TED\nwhich —along  with each  level—adds  its yearly  contributions  and credits  the totals  through\nthe system to the local project .\n•Reports:  Annual  ministry  and financial  reports  must  be submitted  by the local field\nand approved by all levels before the additional year’s funding is sent .\nApplicati on \nThe following  application  can be downloaded  at \nurbancenters.org/application  10 \n11 \n12 \n13 \n14 \n3 APPLICATION  FOR TED MISSION  BOARD  PROJECT  \nHow  to use this form  \n•Download  and submit  the application online at ted.adventist.org/departments/adventist -\nmission\n•The application  contains  four steps  – Basic  Information,  Project  Description,  Budget\nRequest and Project Funding .\nOverview  \n•Preparation  of application:  Local  field and union  must  approve  the application  before\nunion submits to TED. After submission, there is communication with the Adventist\nMission department before possible vote by the Mission Board .\n•Financial  participation : mandatory  at all levels  except  GC.\n•Follow -up communication : applicants  will be informed  of application  outcome .\n•Receiving  funds : After  project  vote,  TED’s  contribution  is credited  to the  union  who—\nalong with each level —adds and credits its contribution towards the project .\n•Report:  A basic  report  must  be submitted  online  by the project  director  within twelve\nmonths of receiving the funds (ted.adventist.org/departments/adventist -mission )\nStep  1: Basic  information  \nYear  of the outreach:  Country:  \nProject title: City/Town:  \nProject Director name:  People Group:  \nProject Director email address: Estimate Population in People Group: \nOrganisation responsible:  Estimate of SDA Presence:  \nStep  2: Project  Description  \nWhen you make the actual application online, the applicant will attach their own project description \nincluding details on preparation, conducting the outreach initiative, and a follow -up process.  15 \nStep  3: Budget  request  \nBudget  request  in local  currency  \nDescription  Amount  \nItem 1: \nItem 2: \nItem 3: \nItem 4: \nItem 5: \nItem 6: \nItem 7: \nItem 8: \nItem 9: \nItem 10: \nItem 11: \nItem 12: \nTotal:  \nStep  4: Project  Funding  \nBudget  contribution  in local  currency  \nLocal  church:  \nConference/Mission:  \nUnion:  \nDivision  funding  requested:  \nTotal:  \nThis application  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). Name of local currency:\nName of local currency:16 \n4 APPLICATION FOR CREATIVE AND INNOVATIVE OUTREACH\nFUND (CIOF)\nHow  to use this form  \n•Download a nd submit  the application online at  ted.adventist .org/departments/adventist -\nmission\n•The application  contains  four steps  – Basic  Information,  Project  Description,  Budget\nRequest and Project Funding .\nOverview  \n•Purpose: The CIOF fund exists to enable local churches to fund missional projects that \nhave not been tried before (i.e. sports, arts, media, business, education, etc.). The total \nfund of £32,000 is spread across the top applications each year.\n•When to apply: All applications must be submitted online by 21 February , 2025,\nfor consideration by the March TED Mission Board.\n•Preparation of application: After application submission, there is communication with \nthe Adventist Mission department before possible vote by the Mission Board.\n•Follow-up communication: applicants will be informed of application outcome.\n•Receiving funds: After project vote, TED’s contribution is credited to the union who—\nalong with each level —adds and credits its contribution towards the project.\n•Report: A basic report must be submitted online by the project director within twelve \nmonths of receiving the funds (ted.adventist.org/departments/adventist-mission ).\nStep  1: Basic  information  \n Year  of the outreach:    Country:  \n Project title:    City/Town:  \n Project Director name:    People  Group:\n Project  Director  email  address:    Estimate  Population  in People  Group:  \n   Organisation  responsible:  Estimate  of SDA Presence:  \nStep  2: Project  Description  \nWhen you make the actual application online, the applicant will attach their own project description \nincluding details on preparation , conducting the outreach initiative , and a follow-up process. 17 \nStep  3: Budget  request  \nBudget  request  in local  currency  \nDescription  Amount  \nItem 1: \nItem 2: \nItem 3: \nItem 4: \nItem 5: \nItem 6: \nItem 7: \nItem 8: \nItem 9: \nItem 10: \nItem 11: \nItem 12: \nTotal:  \nStep  4: Project  Funding  \nBudget  contribution  in local  currency  \nLocal  church:  \nConference/Mission:  \nUnion:  \nDivision  funding  requested:  \nTotal:  \nThis application  must  be submitted  online  (ted.adventist.org/departments/adventist -mission ). Name of local currency:\nName of local currency:18 \n5 APPLICATION  FOR  GC MISSION  IMPACT  FUND \nHow  to use this form  \n•Download the application – once made available by the GC - at\nted.adventist.org/departments/adventist-mission\n•Preparation of application: Local field and union must approve the application\nbefore union submits to TED.\n•Top applications worldwide: The applications that the General Conference ends up \nselecting are not simply the best from a given division but from all applicants worldwide.\n•Submit application online at ted.adventist.org/departments/adventist-mission\nno later than 21 February, 2025.\nPurpose  of Fund  \n•I Will Go!: The General Conference strategy “I Will Go!” envisions every level of the\nchurch—including local churches —to be actively engaged i n expressing its KPI’s, or\n“key performance indicators”. These can be viewed at iwillgo2020.org\n•Alignment of Financial Resources with KPI’s: The General Conference created this\nfund to allocate financial resources specifically to local churches or schools who are doing\nfrontline mission that fulfils one or more GC KPI’s .\n•Project Examples: In addition to existing churches, other applications could be for\nchurch planting, school planting (or evangelism through an existing school), and other\nfrontline projects. For more info regarding the fund’s purpose and past examples, visit\nwillplan.org/services/missionimpactfund\n•Financial Amounts: As a general estimate, applications should range from between\n$30,000 - $100,000 and can be spread out over two years.\nProcess  after  Application  Submission  \n•TED Mission Board Recommends Fifteen Projects: At a following TED Mission Board\nafter the 1 March deadline, a maximum of fifteen projects will be voted to recommend to\nthe General Conference for consideration. Applicants will be informed if any additional\ninformation is needed before the TED Mission Board, and the outcome if their project is\nrecommended or not.\n•GC Votes Mission Impact Projects: The relevant GC board takes recommendations\nfrom TED and votes which projects it will approve.\n•Receiving funds: Once a project is approved, the GC credits the funds to the TED, which\ncredits funds to the Union, and local conference or mission (where relevant) before\nreaching the local church. For multi-year projects, it is within the discretion o f the TED to\nrelease partial funds year by year.\n•Report: A mission and financial report must be completed by each project which will\nbe provided from the GC."
		

	}
	


	
	
		
	
}